from unittest.mock import mock_open, patch

from main import main


@patch("builtins.input", side_effect=["1", "EXECUTED", "да", "по возрастанию", "да", "да", "вклада"])
def test_main(mock_input, capsys):
    mock_input.side_effect = ["1", "EXECUTED", "да", "по возрастанию", "да", "да", "вклада"]
    param = """[{'state': 'EXECUTED', 'date': '2019-08-26T10:50:58.294041', 'operationAmount': {'amount': '31957.58', 'currency': {'name': 'руб.', 'code': 'RUB'}}, 'description': 'Перевод организации', 'from': 'Maestro 1596837868705199', 'to': 'Счет 64686473678894779589'},
                    {'state': 'EXECUTED', 'date': '2019-07-03T18:35:29.512364', 'operationAmount': {'amount': '8221.37', 'currency': {'name': 'USD', 'code': 'USD'}}, 'description': 'Перевод организации', 'from': 'MasterCard 7158300734726758', 'to': 'Счет 35383033474447895560'},
                    {'state': 'EXECUTED', 'date': '2018-06-30T02:08:58.425572', 'operationAmount': {'amount': '9824.07', 'currency': {'name': 'USD', 'code': 'USD'}}, 'description': 'Перевод организации', 'from': 'Счет 75106830613657916952', 'to': 'Счет 11776614605963066702'},
                    {'state': 'EXECUTED', 'date': '2018-03-23T10:45:06.972075', 'operationAmount': {'amount': '48223.05', 'currency': {'name': 'руб.', 'code': 'RUB'}}, 'description': 'Открытие вклада', 'to': 'Счет 41421565395219882431'},
                    {'state': 'EXECUTED', 'date': '2019-04-04T23:20:05.206878', 'operationAmount': {'amount': '79114.93', 'currency': {'name': 'USD', 'code': 'USD'}}, 'description': 'Перевод со счета на счет', 'from': 'Счет 19708645243227258542', 'to': 'Счет 75651667383060284188'},
                    {'state': 'EXECUTED', 'date': '2019-03-23T01:09:46.296404', 'operationAmount': {'amount': '43318.34', 'currency': {'name': 'руб.', 'code': 'RUB'}}, 'description': 'Перевод со счета на счет', 'from': 'Счет 44812258784861134719', 'to': 'Счет 74489636417521191160'}]"""
    m = mock_open(read_data=param)
    with patch("src.utils.get_read_file", return_value=m.return_value):
        print(main())
    captured = capsys.readouterr()
    assert captured.out == (
        "\n"
        "Привет! Добро пожаловать в программу работы с банковскими транзакциями.\n"
        "\n"
        "Для обработки выбран JSON-файл.\n"
        "\n"
        "Введите статус, по которому необходимо выполнить фильтрацию.\n"
        "Доступные для фильтровки статусы: EXECUTED, CANCELED.\n"
        "\n"
        "Операции отфильтрованы по статусу 'EXECUTED'.\n"
        "\n"
        "Отсортировать операции по дате? Да/Нет\n"
        "\n"
        "Отсортировать по возрастанию или по убыванию?\n"
        "\n"
        "Выводить только рублевые транзакции? Да/Нет\n"
        "\n"
        "Отфильтровать список транзакций по определенному слову в описании? Да/Нет\n"
        "\n"
        "Введите слово или фразу для поиска в описании транзакций (перевод с карты\n"
        "на карту, перевод со счета на счет, открытие вклада, перевод организации.)\n"
        "\n"
        "Распечатываю итоговый список транзакций...\n"
        "\n"
        "Всего банковских операций в выборке: 6\n"
        "\n"
        "23.03.2018 Открытие вклада\n"
        "Счет **2431\n"
        "Сумма: 48223.05\n"
        "RUB\n"
        "\n"
        "11.07.2018 Открытие вклада\n"
        "Счет **6215\n"
        "Сумма: 79931.03\n"
        "RUB\n"
        "\n"
        "05.11.2019 Открытие вклада\n"
        "Счет **8381\n"
        "Сумма: 21344.35\n"
        "RUB\n"
        "\n"
        "21.06.2019 Открытие вклада\n"
        "Счет **6762\n"
        "Сумма: 25762.92\n"
        "RUB\n"
        "\n"
        "06.08.2018 Открытие вклада\n"
        "Счет **5758\n"
        "Сумма: 82946.19\n"
        "RUB\n"
        "\n"
        "03.02.2018 Открытие вклада\n"
        "Счет **8767\n"
        "Сумма: 90297.21\n"
        "RUB\n"
        "\n"
        "\n"
    )
